alert('بازی حدس عدد بین 0 تا 10')
alert('فقط سه بار فرصت حدس زدن دارید.')
let x=Math.floor(Math.random() * 10)
for(let k=1;k<=3;k++){
    let n=prompt('عدد مورد نظرتان را وارد کنید.')
    if(x==n){
        alert('آفرین درست حدس زدید!')
        break;
    }else if(x<n){
        alert('عدد کوچکتری را وارد نمایید.')
    }else if(x>n){
       alert('عدد بزرگتری را وارد نمایید.')
    }else{
        alert('لطفا عدد را در فرمت انگلیسی به طور صحیح وارد کنید!')
    }
  if(k==3){
    alert('فرصت شما تمام شد!')
    alert('عدد مورد نظر ' + x + 'بود ')
  }
}